assignment1/benchmarks/openstack/disk_benchmark_randread_2017-06-14:16:26:53.out
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=1446: Wed Jun 14 16:32:41 2017
  read : io=88980KB, bw=379611B/s, iops=92, runt=240023msec
    clat (msec): min=6, max=239, avg=43.15, stdev=21.67
     lat (msec): min=6, max=239, avg=43.15, stdev=21.67
    clat percentiles (msec):
     |  1.00th=[   19],  5.00th=[   23], 10.00th=[   25], 20.00th=[   29],
     | 30.00th=[   31], 40.00th=[   34], 50.00th=[   37], 60.00th=[   41],
     | 70.00th=[   46], 80.00th=[   54], 90.00th=[   70], 95.00th=[   86],
     | 99.00th=[  126], 99.50th=[  143], 99.90th=[  184], 99.95th=[  204],
     | 99.99th=[  229]
    bw (KB  /s): min=   38, max=  133, per=25.00%, avg=92.48, stdev=17.50
    lat (msec) : 10=0.01%, 20=1.65%, 50=74.34%, 100=20.86%, 250=3.14%
  cpu          : usr=0.02%, sys=0.07%, ctx=22265, majf=0, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=22245/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=88980KB, aggrb=370KB/s, minb=370KB/s, maxb=370KB/s, mint=240023msec, maxt=240023msec

Disk stats (read/write):
  vda: ios=22610/12, merge=0/6, ticks=988680/1388, in_queue=990168, util=100.00%