assignment1/benchmarks/openstack/disk_benchmark_randread_2017-06-14:21:53:19.out
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=1694: Wed Jun 14 21:58:59 2017
  read : io=91028KB, bw=388297B/s, iops=94, runt=240055msec
    clat (msec): min=6, max=241, avg=42.18, stdev=19.74
     lat (msec): min=6, max=241, avg=42.18, stdev=19.74
    clat percentiles (msec):
     |  1.00th=[   17],  5.00th=[   21], 10.00th=[   24], 20.00th=[   27],
     | 30.00th=[   30], 40.00th=[   34], 50.00th=[   38], 60.00th=[   43],
     | 70.00th=[   48], 80.00th=[   55], 90.00th=[   68], 95.00th=[   80],
     | 99.00th=[  112], 99.50th=[  124], 99.90th=[  174], 99.95th=[  200],
     | 99.99th=[  237]
    bw (KB  /s): min=   51, max=  126, per=24.94%, avg=94.54, stdev=12.96
    lat (msec) : 10=0.01%, 20=3.93%, 50=70.42%, 100=23.99%, 250=1.66%
  cpu          : usr=0.01%, sys=0.08%, ctx=22784, majf=0, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=22757/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=91028KB, aggrb=379KB/s, minb=379KB/s, maxb=379KB/s, mint=240055msec, maxt=240055msec

Disk stats (read/write):
  vda: ios=22735/10, merge=0/5, ticks=958504/1100, in_queue=959732, util=100.00%