assignment1/benchmarks/openstack/disk_benchmark_randrw_2017-06-14:16:26:53.out
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=1465: Wed Jun 14 16:41:30 2017
  read : io=25804KB, bw=108185B/s, iops=26, runt=244240msec
    clat (msec): min=4, max=23906, avg=140.26, stdev=981.01
     lat (msec): min=4, max=23906, avg=140.26, stdev=981.01
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   19], 10.00th=[   22], 20.00th=[   25],
     | 30.00th=[   29], 40.00th=[   32], 50.00th=[   36], 60.00th=[   40],
     | 70.00th=[   45], 80.00th=[   53], 90.00th=[   69], 95.00th=[   88],
     | 99.00th=[ 4490], 99.50th=[ 5997], 99.90th=[14353], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  142, per=78.76%, avg=82.70, stdev=40.18
  write: io=23972KB, bw=100504B/s, iops=24, runt=244240msec
    clat (usec): min=4, max=19683K, avg=12028.68, stdev=379840.38
     lat (usec): min=4, max=19683K, avg=12029.09, stdev=379840.42
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    9], 90.00th=[   12], 95.00th=[   19],
     | 99.00th=[   46], 99.50th=[   63], 99.90th=[5931008], 99.95th=[9633792],
     | 99.99th=[16711680]
    bw (KB  /s): min=    0, max=  215, per=84.21%, avg=82.53, stdev=47.52
    lat (usec) : 10=39.68%, 20=6.16%, 50=1.97%, 100=0.17%, 250=0.01%
    lat (msec) : 2=0.02%, 10=0.20%, 20=3.91%, 50=35.89%, 100=9.96%
    lat (msec) : 250=1.15%, 500=0.03%, 2000=0.02%, >=2000=0.83%
  cpu          : usr=0.01%, sys=0.02%, ctx=6596, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=6451/w=5993/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=25804KB, aggrb=105KB/s, minb=105KB/s, maxb=105KB/s, mint=244240msec, maxt=244240msec
  WRITE: io=23972KB, aggrb=98KB/s, minb=98KB/s, maxb=98KB/s, mint=244240msec, maxt=244240msec

Disk stats (read/write):
  vda: ios=6447/5438, merge=0/50, ticks=673912/20439020, in_queue=21614136, util=100.00%