assignment1/benchmarks/openstack/disk_benchmark_randrw_2017-06-15:06:59:39.out
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=27387: Thu Jun 15 07:09:34 2017
  read : io=130880KB, bw=578365B/s, iops=141, runt=231724msec
    clat (usec): min=369, max=751575, avg=28107.78, stdev=30387.20
     lat (usec): min=370, max=751575, avg=28108.11, stdev=30387.21
    clat percentiles (usec):
     |  1.00th=[ 1672],  5.00th=[10304], 10.00th=[14016], 20.00th=[17792],
     | 30.00th=[20352], 40.00th=[22400], 50.00th=[24448], 60.00th=[26240],
     | 70.00th=[28288], 80.00th=[30336], 90.00th=[34048], 95.00th=[38144],
     | 99.00th=[185344], 99.50th=[220160], 99.90th=[325632], 99.95th=[444416],
     | 99.99th=[724992]
    bw (KB  /s): min=    4, max=  555, per=25.59%, avg=144.34, stdev=62.32
  write: io=131264KB, bw=580062B/s, iops=141, runt=231724msec
    clat (usec): min=4, max=739270, avg=210.80, stdev=9123.41
     lat (usec): min=4, max=739271, avg=211.19, stdev=9123.42
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   11], 95.00th=[   15],
     | 99.00th=[   40], 99.50th=[   52], 99.90th=[12352], 99.95th=[132096],
     | 99.99th=[432128]
    bw (KB  /s): min=    4, max=  688, per=26.01%, avg=147.21, stdev=76.18
    lat (usec) : 10=41.00%, 20=7.26%, 50=1.49%, 100=0.16%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.06%, 1000=0.03%
    lat (msec) : 2=0.65%, 4=0.14%, 10=1.55%, 20=11.76%, 50=34.18%
    lat (msec) : 100=0.47%, 250=1.06%, 500=0.14%, 750=0.02%, 1000=0.01%
  cpu          : usr=0.03%, sys=0.15%, ctx=33093, majf=0, minf=42
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=564KB/s, minb=564KB/s, maxb=564KB/s, mint=231724msec, maxt=231724msec
  WRITE: io=131264KB, aggrb=566KB/s, minb=566KB/s, maxb=566KB/s, mint=231724msec, maxt=231724msec

Disk stats (read/write):
  vda: ios=32675/26418, merge=0/46, ticks=911304/4572652, in_queue=5483964, util=100.00%