assignment1/benchmarks/openstack/disk_benchmark_randwrite_2017-06-14:16:26:53.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=1458: Wed Jun 14 16:36:57 2017
  write: io=85152KB, bw=362973B/s, iops=88, runt=240226msec
    clat (usec): min=4, max=23800K, avg=45112.66, stdev=664644.63
     lat (usec): min=4, max=23800K, avg=45113.57, stdev=664644.65
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    7], 95.00th=[ 7712],
     | 99.00th=[399360], 99.50th=[798720], 99.90th=[14745600], 99.95th=[16056320],
     | 99.99th=[16711680]
    bw (KB  /s): min=    0, max=41647, per=100.00%, avg=416.09, stdev=3903.40
    lat (usec) : 10=92.88%, 20=1.07%, 50=0.28%, 100=0.05%, 250=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=1.14%, 20=0.04%, 50=0.01%
    lat (msec) : 250=3.49%, 500=0.39%, 750=0.06%, 1000=0.08%, 2000=0.11%
    lat (msec) : >=2000=0.38%
  cpu          : usr=0.01%, sys=0.01%, ctx=5096, majf=0, minf=43
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=21288/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=85152KB, aggrb=354KB/s, minb=354KB/s, maxb=354KB/s, mint=240226msec, maxt=240226msec

Disk stats (read/write):
  vda: ios=1/7533, merge=0/6171, ticks=76/315688, in_queue=315768, util=99.92%