assignment1/benchmarks/openstack/disk_benchmark_randwrite_2017-06-14:21:53:19.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=1701: Wed Jun 14 22:03:40 2017
  write: io=56776KB, bw=242066B/s, iops=59, runt=240176msec
    clat (usec): min=4, max=20400K, avg=67677.50, stdev=364065.08
     lat (usec): min=4, max=20400K, avg=67678.04, stdev=364065.15
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    5], 60.00th=[    7],
     | 70.00th=[   55], 80.00th=[199680], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[264192], 99.90th=[2408448], 99.95th=[2998272],
     | 99.99th=[16711680]
    bw (KB  /s): min=    0, max=15502, per=30.50%, avg=71.98, stdev=721.82
    lat (usec) : 10=63.01%, 20=5.71%, 50=1.18%, 100=0.20%
    lat (msec) : 2=0.01%, 4=0.02%, 10=0.03%, 20=0.10%, 50=0.10%
    lat (msec) : 100=0.44%, 250=28.65%, 500=0.32%, 750=0.03%, 2000=0.06%
    lat (msec) : >=2000=0.14%
  cpu          : usr=0.01%, sys=0.02%, ctx=5033, majf=0, minf=47
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=14194/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=56776KB, aggrb=236KB/s, minb=236KB/s, maxb=236KB/s, mint=240176msec, maxt=240176msec

Disk stats (read/write):
  vda: ios=1/5157, merge=0/3049, ticks=92/415108, in_queue=415312, util=99.95%